# 데이터 재구조화 - 2

In [1]:
from hossam import load_data
from pandas import DataFrame

In [2]:
origin = load_data('body_size')
origin

[data] https://data.hossam.kr/data/lab05/body_size.xlsx
[desc] 어느 학급 학생들의 이름, 성별, 키, 몸무게에 대한 가상의 데이터(메타데이터 없음)

field    description
-------  -------------
name     이름
sex      성별
height   키
weight   몸무게

     sex  height  weight
name
Lee    M     175    98.0
Park   F     167    48.0
Hong   M     180     NaN
Kim    F     162    55.0
Nam    M     172    85.0

In [4]:
st1 = origin.stack()
print(type(st1))
st1

<class 'pandas.core.series.Series'>

name
Lee   sex          M
      height     175
      weight    98.0
Park  sex          F
      height     167
      weight    48.0
Hong  sex          M
      height     180
Kim   sex          F
      height     162
      weight    55.0
Nam   sex          M
      height     172
      weight    85.0
dtype: object

### Stack -> DataFram으로 생성

In [5]:
df1 = DataFrame(origin.stack())
df1

                0
name
Lee  sex        M
     height   175
     weight  98.0
Park sex        F
     height   167
     weight  48.0
Hong sex        M
     height   180
Kim  sex        F
     height   162
     weight  55.0
Nam  sex        M
     height   172
     weight  85.0

In [7]:
# 빈 값 포함시키기
# stack -> DataFrame 전환시 자동으로 NaN(결측치)가 빠진다

st2 = origin.stack(dropna=False)
df2 = DataFrame(st2)
df2

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_32332\686793615.py:4: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  st2 = origin.stack(dropna=False)

                0
name
Lee  sex        M
     height   175
     weight  98.0
Park sex        F
     height   167
     weight  48.0
Hong sex        M
     height   180
     weight   NaN
Kim  sex        F
     height   162
     weight  55.0
Nam  sex        M
     height   172
     weight  85.0

In [8]:
import pandas as pd
print(pd.__version__)

2.3.3

In [9]:
st2.unstack()

     sex height weight
name
Lee    M    175   98.0
Park   F    167   48.0
Hong   M    180    NaN
Kim    F    162   55.0
Nam    M    172   85.0

### 연습문제

In [42]:
origin = load_data('game_scores')
origin

[data] https://data.hossam.kr/data/lab05/game_scores.xlsx
[desc] 최근 열린 게임 토너먼트 경기 결과 데이터 (인덱스와 메타데이터 없음)
[!] Cannot read metadata

    player  stage1  stage2  stage3
0    Alice      85    92.0    88.0
1      Bob      78     NaN    95.0
2  Charlie      90    88.0    91.0
3    David      82    85.0     NaN
4      Eva      95    98.0    99.0

In [44]:
df1 = origin.dropna()
df2 = df1.set_index('player')
df3 = DataFrame(df2.stack())
df3

                   0
player
Alice   stage1  85.0
        stage2  92.0
        stage3  88.0
Charlie stage1  90.0
        stage2  88.0
        stage3  91.0
Eva     stage1  95.0
        stage2  98.0
        stage3  99.0

In [46]:
df4 = df3.reset_index()
df4.filter(['player','0']).groupby('player').mean
df4

    player level_1     0
0    Alice  stage1  85.0
1    Alice  stage2  92.0
2    Alice  stage3  88.0
3  Charlie  stage1  90.0
4  Charlie  stage2  88.0
5  Charlie  stage3  91.0
6      Eva  stage1  95.0
7      Eva  stage2  98.0
8      Eva  stage3  99.0